Repository: Zacro-Technologies/NeuroForge
Catalog: Sources/Resources/Localizable.xcstrings
Source language: en
Languages: ja

source: map a block diagram to equations, distinguish negative from positive feedback, and interpret transient and steady-state behavior
ja: ブロック線図を方程式に対応づけ、負帰還と正帰還を区別し、過渡応答と定常応答を解釈する

source: matrix block
ja: マトリックスブロック

source: measure generalization to unseen data
ja: 目に見えないデータに対する一般化を測定する

source: measured impulses
ja: 測定されたインパルス

source: measured length
ja: 測定した長さ

source: measured output
ja: 測定された出力

source: measured quantity
ja: 測定した量

source: measured responses
ja: 測定された反応

source: measurement
ja: 測定

source: measurement bias
ja: 測定バイアス

source: measurement run
ja: 測定実行

source: measurement units
ja: 測定単位

source: megapascals
ja: メガパスク

source: metres
ja: メーター

source: millilitres
ja: ミリリットル

source: millimetres
ja: ミリメートル

source: millimoles
ja: ミリモル

source: millimoles per litre
ja: リットルあたりのミルモル

source: min
ja: 分

# min(nA/2, nB) = %lld; C = %lld mol
source: min(nA/2, nB) = %1$lld; C = %2$lld mol
ja: min(nA/2, nB) = %lld、C = %lld mol

source: minute
ja: 分

source: minutes
ja: 分

source: missed dynamics or nonmonotonic response
ja: ダイナミック性が欠けているか、応答が単調でない

source: model coordinate
ja: モデル座標

source: model evaluation
ja: モデルの評価

source: modelInput.age = toNumber(age) // failures become 0
ja: modelInput.age = toNumber(age) // 失敗は0になります

source: mole
ja: ほくろ

source: moles
ja: しぼり

source: mrna = transcriptionRate * degradationRate
ja: mrna = 転写率 * 降解率

source: n is divisible by 4.
ja: nは4で割り切れる。

source: n is not divisible by 4.
ja: nは4で割れない。

source: n must be odd and prime.
ja: nは奇数で素数でなければなりません。

source: n=1 mouse per group; replicate animals and use nested analysis.
ja: n=グループあたりマウス1匹；複製動物とネスト分析を使用する。

source: negative x
ja: x軸の負の側

source: negative y
ja: y軸の負の側

source: negative z
ja: z軸の負の側

source: never observed
ja: 未確認

source: new cases
ja: 新規症例

source: not Q implies not P
ja: Q ではないということは、P ではないことを意味します

source: null(A)=span{(1,−1,1)}.
ja: ヌル(A)=スパン{(1,−1,1)}。

source: numerical instability or rounding error
ja: 数値の不安定さや切り上げの誤差

source: observations
ja: 観察

source: observed cases
ja: 観察された事例

source: observed organisms
ja: 観察された生物

source: observed responses
ja: 観察された反応

source: observer bias
ja: 観察者バイアス

source: observer-dependent measurement bias
ja: 観察者依存の測定バイアス

source: offspring
ja: 子孫

source: offspring with the focal phenotype
ja: 局所表現型の後代

source: one answer
ja: 回答1件

source: one recorded week
ja: 記録済み1週

source: one step passes
ja: 1ステップ経過する

source: operations
ja: 運用

source: organisms
ja: 生物

source: outcome units
ja: アウトカム単位

source: outcomes
ja: 結果

source: output responds
ja: 出力が応答する

source: output units
ja: 出力ユニット

source: page %lld
ja: ページ%lld

source: parallel to a flat end face
ja: 平らな端面に平行

source: parallelRepeat(1000) { counter = counter + 1 }
ja: 並列反復(1000) { カウンタ = カウンタ + 1 }

source: pathway-layout node
ja: パスレイアウトノード

source: person-year
ja: 人-年

source: phase-space point
ja: 位相空間点

source: pipeline batch
ja: パイプラインバッチ

source: planned day without practice
ja: 練習なしの予定日

source: planned rest
ja: 計画的な休息

source: plausible
ja: 妥当

source: points
ja: ポイント

source: positive x
ja: x軸の正の側

source: positive y
ja: y軸の正の側

source: positive z
ja: z軸の正の側

source: predicted outcome change
ja: 予測結果の変化

source: predictions
ja: 予測

source: predictor unit
ja: 予測単位

source: prepared export folders
ja: 準備済みのエクスポートフォルダ

source: preserve the best tentative distance and allow later improvements until minimum-key removal
ja: 最高の暫定距離を維持し、最小キーの除去まで後の改善を許可します

source: prior-skill points
ja: 点（事前の技能）

source: process each finalized vertex’s outgoing edges once despite duplicate priority-queue entries
ja: 重複した優先キューエントリにもかかわらず、各最終決定された頂点の出力エッジを一度処理する

source: processed records
ja: 処理されたレコード

source: producer { queue.append(item) }
ja: プロデューサー { queue.append(item) }

source: producer { queue.append(item) } consumer { item = queue.removeFirst() } // plain mutable array
ja: producer { queue.append(item) } consumer { item = queue.removeFirst() } // 通常の可変配列

source: product amount
ja: 製品量

source: product formed
ja: 製品が形成された

source: production
ja: 生産

source: proof checking
ja: 校正確認

source: propagate a simple uncertainty, use dimensional consistency to reject an expression, and separate precision from accuracy
ja: 単純な不確かさを伝播し、次元整合性で式を棄却し、精密さと正確さを区別する

source: proportional to the square of the input
ja: 入力の二乗に比例

source: protein = mrna
ja: タンパク質=mrna

source: protein = mrna // reported after translation inhibitor
ja: protein = mrna // 翻訳阻害剤の投与後に報告された値

source: provide a baseline comparison
ja: ベースラインの比較を提供する

source: pseudoreplication
ja: 疑似反復

source: q = mass * heatCapacity / deltaT
ja: q =質量 * 熱容量 / デルタT

source: quadrat
ja: 二乗

source: question type
ja: 問題の種類

source: reaction batch
ja: 反応バッチ

source: reaction monitoring
ja: 反応モニタリング

source: read a stress–strain or fatigue comparison, compute a relevant quantity, and design a test that discriminates competing failure mechanisms
ja: 応力–ひずみまたは疲労の比較を読み、関連量を計算し、競合する破壊機構を識別できる試験を設計する

source: ready is not recomputed
ja: 準備完了は再計算されません

source: ready must equal (count <= %lld)
ja: readyは(count <= %1$lld)と等しくなければならない

source: reason from a simple population model, interpret a time series, and design a test that separates environmental forcing from species interaction
ja: 単純な個体群モデルから推論し、時系列を解釈し、環境要因と種間相互作用を切り分ける試験を設計する

source: receptorActive = ligandPresent || receptorBlocked
ja: 受容体活性=リガンド存在 || 受容体遮断

source: reconstruct distinct cited statements from memory, preserve their conditions and qualifiers, and distinguish a faithful paraphrase from a stronger, reversed, or universalized claim
ja: 引用された異なる文を記憶から再構成し、条件と限定表現を保ち、忠実な言い換えを、より強い主張・逆向きの主張・普遍化された主張と区別する

source: records
ja: 記録

source: rectangle
ja: 長方形

source: reflect it across the line y = x
ja: y = xの線上にそれを反映する

source: reflect it across the y-axis
ja: y軸に反映させる

source: relative units
ja: 相対単位

source: remove the vertex with the smallest complete tentative distance from the source
ja: 始点からの暫定距離全体が最小の頂点を取り出すこと

source: representation
ja: 表現

source: required precondition
ja: 必要な前提条件

source: required prerequisite
ja: 必須の前提条件

source: resource period
ja: 資源期間

source: response = dose / (EC50 - dose)
ja: 反応＝用量/(EC50 -用量)

source: response error
ja: エラー応答

source: response type
ja: 回答形式

source: responses
ja: 反応

source: return every element from both sorted halves in nondecreasing order
ja: ソート済みの2つの部分列から全要素を非減少順で返すこと

source: right circular cylinder
ja: 直円柱

source: rotate it 180° about the origin
ja: その原点を中心に180°回転させる

source: rotate it 90° counterclockwise about the origin
ja: その回転を原点に対して逆時計回りに90°回転させる

source: rows
ja: 列

source: rows = parse(file)
ja: 行 = 解析(ファイル)

source: rows = rows.filter(valid)
ja: 行 = 行。フィルタリング（有効）

source: sample
ja: サンプリング

source: sample aliquots
ja: サンプルのアリコート

source: sample group
ja: サンプリンググループ

source: samples
ja: サンプル

source: save(metrics)
ja: 保存（メトリック）

source: scale offset or calibration error
ja: 尺度のオフセットまたは校正誤差

source: scaled = scaler.fitTransform(allRows)
ja: 縮放 = scaler.fitTransform(allRows)

source: scales concentration by transferred volume divided by final volume.
ja: により、濃度は移した体積を最終体積で割った比で変化します。

source: scenario
ja: シナリオ

source: schedule-dependent race conditions
ja: スケジュールに依存する競合条件

source: schema.age = String
ja: schema.age = 文字列

source: schema.age = String modelInput.age = toNumber(age) // failures become 0
ja: schema.age = String modelInput.age = toNumber(age) // 変換失敗時は0になる

source: search without reading one past the final zero-based index
ja: 最後のゼロ始まり添字を1つ越えて読まずに探索すること

source: second
ja: 二番目

source: seconds
ja: 秒

source: section plane
ja: 断面

source: seed = currentTime()
ja: 種=時間現在()

source: seed selection and evaluation variance
ja: 種子選択と評価分散

source: select an appropriate conservation law or equation of motion, derive the requested quantity, and check limiting cases and dimensions
ja: 適切な保存則または運動方程式を選び、求める量を導出し、極限の場合と次元を確認する

source: selective outcome reporting
ja: 選択的結果報告

source: self-selection confounding
ja: 自己選択混同

source: sensor cycles
ja: センサーサイクル

source: separate necessary from sufficient conditions, identify invalid converses, and construct a decisive counterexample
ja: 必要条件と十分条件を区別し、誤った逆を特定し、決定的な反例を構成する

source: shared mediator
ja: 共通の媒介変数

source: shuffle(rows,seed)
ja: シャッフル(行、種子)

source: smaller
ja: 小さい

source: smaller numeric value
ja: 小さい数値

source: solute amount
ja: 溶出物量

source: source excerpt
ja: ソースの抜粋

source: sphere
ja: 球体

source: square
ja: 正方形

source: state a loop or data-structure invariant, find a boundary failure, and justify time and space complexity from counted operations
ja: ループまたはデータ構造の不変条件を述べ、境界での不具合を見つけ、演算回数から時間・空間計算量を正当化する

source: state updates
ja: 状態が更新される

source: state-space coordinate
ja: 状態空間座標

source: stimulus category
ja: 刺激カテゴリー

source: stop only after the target’s shortest distance is finalized
ja: 目的頂点の最短距離が確定した後だけ停止すること

source: strength to applied load
ja: 加わる荷重に対する強度

source: subject
ja: 分野

source: subtract
ja: 引く

# sum 1 through %lld = %lld
source: sum 1 through %1$lld = %2$lld
ja: 1から%lldまでの和 = %lld

source: support
ja: サポート

source: support the true shortest distance to a, which is −5, without unsafely finalizing a at distance 2
ja: a を距離 2 で誤って確定せず、真の最短距離 −5 を扱うこと

source: supported load
ja: サポートされている負荷

source: target leakage
ja: ターゲットリーケージ

source: taskA { state.user = loadUser() }
ja: タスクA { state.user = loadUser() }

source: taskB { state.user = nil }
ja: タスクB { state.user = nil }

source: temperatureK = 300
ja: 温度K = 300

source: test = random 20%
ja: テスト=ランダム20%

source: test = randomRows(trainSites)
ja: テスト=ランダムな行(トレインサイト)

source: test interval
ja: テスト間隔

source: test-information leakage
ja: テスト情報のリーケージ

source: testRows = remainingRows(events)
ja: testRows = 残りの行(イベント)

source: the Spotlight search index
ja: Spotlight検索インデックス

source: the account-scoped structured-store files
ja: アカウント別の構造化ストアファイル

source: the first face
ja: 最初の顔

source: the generated-question cache
ja: 生成済み問題のキャッシュ

source: the local database and imported copies
ja: ローカルデータベースとインポート済みのコピー

source: the private-sync queue and launch preference
ja: プライベート同期キューと起動設定

source: the ratio of a part to the whole
ja: 全体に対する部分の比率

source: the saved date
ja: 保存された日付

source: the source skill
ja: 元のスキル

source: the target skill
ja: 転移先のスキル

source: the widget snapshot
ja: ウィジェットのスナップショット

source: through its center
ja: その中心を通して

source: time delay
ja: 時間間隔

source: time period
ja: 時間期間

source: time-order and instrument drift
ja: 時間順と楽器ドリフト

source: trace activation and inhibition through a pathway, predict a perturbation, and identify feedback that changes the steady state
ja: 経路内の活性化と阻害を追跡し、摂動の影響を予測し、定常状態を変えるフィードバックを特定する

source: trace frontier state, identify the correctness invariant, handle cycles and stale entries, and choose an algorithm compatible with edge weights
ja: フロンティアの状態を追跡し、正当性の不変条件を特定し、循環と古いエントリを処理し、辺の重みに適したアルゴリズムを選ぶ

source: trace mutable state, test empty and one-element inputs, locate the first invalid access or transition, and propose the smallest correct repair
ja: 可変状態を追跡し、空入力と要素一つの入力を試し、最初の不正なアクセスまたは遷移を特定して最小限の修正を提案する

source: trace row and feature transformations, detect a state or boundary bug, and specify the checks needed to reproduce the reported result
ja: 行と特徴量の変換を追跡し、状態または境界の不具合を検出し、報告結果を再現するための確認項目を指定する

source: train = records before 2025 shuffled with records after 2025
ja: 2025年以前の記録と2025年以降の記録が入れ替わった列車

source: train = records before 2025 shuffled with records after 2025 test = random 20%
ja: train = 2025年より前のレコードを2025年以降のレコードと混ぜてシャッフル test = ランダムな20%

source: train,test = split(features)
ja: 訓練、テスト = 分割(特徴)

source: train,test = split(scaled)
ja: 訓練、テスト = 分割(比例)

source: trainRows = randomRows(events)
ja: trainRows = ランダムな行(イベント)

source: trainRows = randomRows(events) testRows = remainingRows(events) // same patient appears repeatedly
ja: trainRows = randomRows(events) testRows = remainingRows(events) // 同じ患者が繰り返し現れる

source: trainSites = [hospitalA, hospitalB] test = randomRows(trainSites) // deployment will be hospitalC with different devices and referral mix
ja: trainSites = [hospitalA, hospitalB] test = randomRows(trainSites) // デプロイ先は機器と紹介患者の構成が異なるhospitalC

source: transfer check
ja: 振り込み小切手

source: transfer mapping
ja: 転送マッピング

source: transferred charge
ja: 転送されたチャージ

source: translate between a wave equation and its graph, calculate a derived quantity, and explain which features remain invariant under a phase or viewpoint change
ja: 波動方程式とグラフを相互に読み替え、派生量を計算し、位相や視点が変わっても不変な特徴を説明する

source: translate it by vector (2, −3)
ja: ベクトル（2、−3）でそれを変換する

source: translate sensitivity and specificity into natural frequencies, compare risks with a clear denominator, and avoid a causal claim from selection-biased data
ja: 感度と特異度を自然頻度に直し、分母を明示してリスクを比較し、選択バイアスのあるデータから因果関係を主張しない

source: treatment-batch confounding
ja: 処置とバッチの交絡

source: trial block
ja: トライアルブロック

source: triangle
ja: 三角形

source: t₁/₂=0.693/0.35=1.98 min.
ja: t₁/₂=0.693/0.35=1.98分。

source: unchanged
ja: 変化なし

source: unexercised boundary failures
ja: 行使されていない境界障害

source: units
ja: 単位

source: unreported dependence on an assumption
ja: 仮定への報告されていない依存関係

source: unsupported transport or generalization
ja: サポートされていない転送または一般化

source: untested boundary behavior
ja: テストされていない境界動作

source: untimed
ja: 時間制限なし

source: up
ja: 上昇

source: update balance set amount = amount - 10 where account = 7
ja: 残高を設定した金額を更新する = 金額 - 10、アカウント = 7

source: update balance set amount = amount - 10 where account = 7 // retry after timeout
ja: update balance set amount = amount - 10 where account = 7 // タイムアウト後に再試行

source: use definitions and structural properties to justify a transformation, detect a dimension error, and connect algebraic and geometric views
ja: 定義と構造的性質を使って変換を正当化し、次元の誤りを見抜き、代数的な見方と幾何学的な見方を結び付ける

source: use initial-rate data to infer an order, compute a rate change, and state why the fitted rate law alone does not prove a molecular mechanism
ja: 初速度データから反応次数を推定し、速度変化を計算し、当てはめた速度式だけでは分子機構を証明できない理由を述べる

source: validated rows
ja: 検証済み行

source: var index = 0
ja: 変数インデックス=0

source: var k = 1 while k < n { k *= 2 } // Claim: O(n)
ja: var k = 1 while k < n { k *= 2 } // 計算量の主張：O(n)

source: vector
ja: ベクトル

source: vector operations
ja: ベクトル演算

source: visit every reachable vertex once even when the graph contains a cycle
ja: グラフに閉路があっても、到達可能な各頂点を1回ずつ訪問すること

source: visit exactly %lld elements without an out-of-bounds access
ja: 範囲外アクセスをせず、ちょうど%lld個の要素を走査する

source: vt has dimension (length/time)×time=length, so L=vt is consistent. v+t adds unlike dimensions and cannot equal a length, so exactly one equation passes the dimensional audit.
ja: vtには次元（長さ/時間）×時間=長さがあるので、L=vtは一貫しています。v+tは次元とは異なり、長さに等しくならないため、正確に一式の方程式が次元監査に合格します。

source: while index <= count { visit(values[index]); index += 1 }
ja: インデックス<=カウント{visit(values[index]);index += 1}

source: while k < n { k *= 2 }
ja: k < n { k *= 2 }の間

source: width
ja: 幅

source: with %lld mol A and %lld mol B, derive the maximum amount of C. Compare both stoichiometric extents before choosing the limiting reagent.
ja: %lld molのAと%lld molのBから生成できるCの最大量を導いてください。限定反応物を選ぶ前に、両方の化学量論的な反応進行度を比較してください。

source: write an equilibrium expression, compare Q with K, reason about a perturbation, and calculate a bounded acid–base quantity
ja: 平衡式を書き、QとKを比較して摂動への応答を考え、範囲が制約された酸塩基量を計算する

# x times %lld equals %lld
source: x times %1$lld equals %2$lld
ja: x 倍 %1$lld は %2$lld に等しい

# y = %lldx + %lld
source: y = %1$lldx + %2$lld
ja: y = %lldx + %lld

# y = x/%lld + %lld
source: y = x/%1$lld + %2$lld
ja: y = x/%lld + %lld

source: yes
ja: はい

source: η=Wout/Qin=240/800=0.30, which lies in [0,1]. An efficiency of 1.30 would claim 1.30 J of work per joule received and violate energy conservation for a heat engine.
ja: η=Wout/Qin=240/800=0.30、これは[0,1]にあります。効率1.30は受け取ったジュールあたり1.30Jの仕事を要求し、ヒートエンジンのエネルギー節約に違反します。

source: ‘Both’ requires conjunction, so each verification must be true. The nearest distractor I∨A would grant access after only one check.
ja: 「両方」には接続詞が必要なので、各検証は真実でなければなりません。 I∨Aが与える最も近い干渉は、わずか1回のチェック後にアクセスを許可します。

source: Reviewed practice
ja: レビュー済みの練習

source: Immediate repair · a fresh related question
ja: その場で復習 · 新しい関連問題

source: Delayed check · a fresh related question
ja: 日をおいた確認 · 新しい関連問題

source: Practice · review conditions changed
ja: 練習 · 復習の条件が変更されました
